Documents/ПересчетДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПересчетДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Долг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Выдавший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Долг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПересчетДолга/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Долги.Записывать = Истина;
	Движение = Движения.Долги.Добавить();
	Движение.ВидДвижения = ?(Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	Движение.Долг = Долг;
	Движение.Период = Дата;
	Движение.Выдавший = Долг.Выдавший;
	Движение.Сумма = ?(Сумма < 0, Сумма * -1, Сумма);

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Сумма < 0 Тогда
		 	Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДолгиОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.Долги.Остатки(&МоментВремени, Выдавший = &Выдавший) КАК ДолгиОстатки";
			Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
			Запрос.УстановитьПараметр("Выдавший", Долг.Выдавший);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Остаток = 0;
			Иначе
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				Остаток = Выборка.СуммаОстаток;
			КонецЕсли; 			
			
			Если Остаток < Сумма * -1 Тогда
				Отказ = Истина;
				Сообщить("Сумма списания больше суммы оставшегося долга!");
			КонецЕсли; 
			
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
